alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/functions/USCI.c
#include "msp430fg479.h"
#include <msp430.h>
#include <stdio.h>
#include <stdint.h>  // Neccesary for  uint16_t
#include "SD16_A.h"
#include <assert.h>  // For using assert
#include <stdbool.h> 
#include <math.h>


//*****************************************************************************
/*USCI INITIALIZATION AND RESET FUNCTIONS*/
//*****************************************************************************

void USCI_setup(){
    //Set the bit UCSWRST in register USCI_A0 Control Register 1 
    UCA0CTL1 |= UCSWRST;

}

void USCI_init(){
    //Reset the bit UCSWRST in register USCI_A0 Control Register 1 
    UCA0CTL1 &= ~(UCSWRST);
}

void USCI_B_init(){
    //Reset the bit UCSWRST in register USCI_A0 Control Register 1 
    UCB0CTL1 &= ~(UCSWRST);
}

void init_UART_GPIO()
{
    P2SEL = BIT4 | BIT5;                      // P2.5 = RXD, P2.4=TXD
}


void USCI_clk_ref(char clk_ref){
    /*clk_ref:
        U --> UCLK
        A --> ACLK
        S --> SMCLK        
    */
    UCA0CTL1 &= ~(UCSSEL_0|UCSSEL_1|UCSSEL_2|UCSSEL_3);
    switch (clk_ref) {
        case 'U': //UCLK
            UCA0CTL1|=UCSSEL_0;
            break;
        case 'A': //ACLK
            UCA0CTL1|=UCSSEL_1;
            break;
        case 'S': //SMCLK
            UCA0CTL1|=UCSSEL_2;
            break;
        default:
            perror("Error: Not available clk reference in USART.");
            break;
    }
}

void USCI_B_clk_ref(char clk_ref){
    /*clk_ref:
        U --> UCLK
        A --> ACLK
        S --> SMCLK        
    */
    UCB0CTL1 &= ~(UCSSEL_0|UCSSEL_1|UCSSEL_2|UCSSEL_3);
    switch (clk_ref) {
        case 'U': //UCLK
            UCB0CTL1|=UCSSEL_0;
            break;
        case 'A': //ACLK
            UCB0CTL1|=UCSSEL_1;
            break;
        case 'S': //SMCLK
            UCB0CTL1|=UCSSEL_2;
            break;
        default:
            perror("Error: Not available clk reference in USART.");
            break;
    }
}

void USCI_interrupt_enable(bool enable_USCI_interr_rx, bool enable_USCI_interr_tx){
    IE2 &= ~(UCA0RXIE|UCA0TXIE);
    if (enable_USCI_interr_rx){
        IE2 |= UCA0RXIE;                 // Enable USCI_A0 RX interrupt
    }else if (enable_USCI_interr_tx){
        IE2 |= UCA0TXIE;                 // Enable USCI_A0 TX interrupt

    };
}

void USCI_B_interrupt_enable(bool enable_USCI_interr_rx, bool enable_USCI_interr_tx){
    IE2 &= ~(UCB0RXIE|UCB0TXIE);
    if (enable_USCI_interr_rx){
        IE2 |= UCB0RXIE;                 // Enable USCI_B0 RX interrupt
    }else if (enable_USCI_interr_tx){
        IE2 |= UCB0TXIE;                 // Enable USCI_B0 TX interrupt

    };
}


//*****************************************************************************
/*UART RELATED FUNCTIONS*/
//*****************************************************************************

//Character format decision
void character_format_sel(bool parity_enable, char parity_type, int num_data_bit, int num_stop_bit, char first_Byte_sent){
    //parity enable:
        //True --> parity ON
        //False --> parity OFF            
    //if parity enable:
        //parity_type:
            //E --> even (par)
            //O --> odd (impar)
    //num_data_bit: quantity of data bits available (character length)
        //7 or 8
    //num_stop_bit: stop bit select, one at least
        //1 or 2
    //first_byte_sent: To choose between MSB or LSB 
        //M: MSB first
        //L: LSB first
    
    // first clear all bits
    UCA0CTL0 &= ~(UCPEN|UCPAR|UCMSB|UC7BIT|UCSPB);
    //parity enable
    if (parity_enable){
        UCA0CTL0 |= UCPEN;
        switch (parity_type) {
            case 'E':
                UCA0CTL0 |= UCPAR;
                break;
            case 'O':
                break;
            default:
                perror("Error: Not available parity in UART selection.");
                break;
        }
    }

    switch (num_data_bit) {
        case 7:
            UCA0CTL0 |= UC7BIT;
            break;
        case 8:
            break;
        default:
            perror("Error: Not available number of data bits in UART selection.");
            break;
    }
    
    switch (num_stop_bit) {
        case 1:
            break;
        case 2:
            UCA0CTL0 |= UCSPB;
            break;            
        default:
            perror("Error: Not available number of stop bits in UART selection.");
            break;
    }
    
    switch (first_Byte_sent){
        case 'L':
            break;
        case 'M':
            UCA0CTL0 |= UCMSB;        
            break;
        default:
            perror("Error: Not available first Byte  in UART selection.");
            break;
    }
}

void USCI_mode_sel(char USCI_mode){
    //U --> Uart
    //I --> IDLE-LINE MULTIPROCESSOR MODE
    //D --> ADDRESS-BIT MULTIPROCESSOR MODE
    //A --> UART MODE WITH AUTOMATIC BAUD RATE DETECTION
    UCA0CTL0 &= ~(UCMODE0|UCMODE1);
    switch (USCI_mode) {
        case 'U': //UART
            break;
        case 'I': //IDLE-LINE MULTIPROCESSOR MODE
            UCA0CTL0 |= UCMODE0;
            break;
        case 'D': //ADDRESS-BIT MULTIPROCESSOR MODE
            UCA0CTL0 |= UCMODE1;
            break;
        case 'A'://UART MODE WITH AUTOMATIC BAUD RATE DETECTION
            UCA0CTL0 |= UCMODE1+UCMODE0;
            break;
        default:
            perror("Error: Not available UART mode.");
            break;
    }
}




void USCI_B_mode_sel(char USCI_mode){
    //U --> Uart
    //I --> IDLE-LINE MULTIPROCESSOR MODE
    //D --> ADDRESS-BIT MULTIPROCESSOR MODE
    //A --> UART MODE WITH AUTOMATIC BAUD RATE DETECTION
    UCB0CTL0 &= ~(UCMODE0|UCMODE1);
    switch (USCI_mode) {
        case 'U': //UART
            break;
        case 'I': //IDLE-LINE MULTIPROCESSOR MODE
            UCB0CTL0 |= UCMODE0;
            break;
        case 'D': //ADDRESS-BIT MULTIPROCESSOR MODE
            UCB0CTL0 |= UCMODE1;
            break;
        case 'A'://UART MODE WITH AUTOMATIC BAUD RATE DETECTION
            UCB0CTL0 |= UCMODE1+UCMODE0;
            break;
        default:
            perror("Error: Not available UART mode.");
            break;
    }
}

void data_to_transmit(uint8_t data){
    while (!(IFG2&UCA0TXIFG));                // The register for the data only can be written if the flag UCA0TXIFG is up
    UCA0TXBUF = data;
}
/*
void UART_baudrate_generation(float ref_frec, float baudrate_wanted){
    UCA0MCTL  &= ~(UCOS16);
    float N = ref_frec/baudrate_wanted;
    char BR = 'L'; //baudrate indicator, if N >= 16 -- > High, else --> low --> for the selection of the configuration

    if (N>=16){
        UCA0MCTL |= UCOS16;
        BR = 'H';
    }

    switch (BR) {
        case 'L':
            int UCBRX = int(N);

            //UCBRX = UCA0BR0 + UCA0BR1*256;
            int prod = int(UCBRX/256);
            UCA0BR1 = prod;
            UCA0BR0 = UCBRX-prod*256;




            break;

        default:
            perror("Error:Something went wrong in selecting baudrate.");
            break; 
    }

