alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/functions/USCI.c
}
*/

void UART_baudrate_generation(int32_t BRCLK_freq, int32_t baudrate){
    switch ((int)BRCLK_freq) {
        case (int)32768:
            switch ((int)baudrate) {
                case (int)1200:
                    UCA0BR0 = 27;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_2;                       
                    break;

                case (int)2400:
                    UCA0BR0 = 13;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_6;                       
                    break;

                case (int)4800:
                    UCA0BR0 = 6;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_7;                       
                    break;

                case (int)9600:
                    UCA0BR0 = 3;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_3;                       
                    break;

                default:
                    perror("Error: Something went wrong in selecting baudrate.");
                    break; 

            }
        break;
        
        case (int)1000000:
            switch ((int)baudrate) {
                case (int)9600:
                    UCA0BR0 = 104;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_1;                       
                    break;

                case (int)19200:
                    UCA0BR0 = 52;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_0;                       
                    break;

                case (int)38400:
                    UCA0BR0 = 26;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_0;                       
                    break;

                case (int)57600:
                    UCA0BR0 = 17;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_3;                       
                    break;

                case (int)115200:
                    UCA0BR0 = 8;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_6;                       
                    break;

                
                default:
                    perror("Error: Something went wrong in selecting baudrate.");
                    break; 
            }
        break;

        case (int)1048576:
            switch ((int)baudrate) {
                case (int)9600:
                    UCA0BR0 = 109;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_2;                       
                    break;

                case (int)19200:
                    UCA0BR0 = 54;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_5;                       
                    break;

                case (int)38400:
                    UCA0BR0 = 27;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_2;                       
                    break;

                case (int)57600:
                    UCA0BR0 = 18;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_1;                       
                    break;

                case (int)115200:
                    UCA0BR0 = 9;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_1;                       
                    break;

                
                default:
                    perror("Error: Something went wrong in selecting baudrate.");
                    break; 
            }
        break;

        case (int)4000000:
            switch ((int)baudrate) {
                case (int)9600:
                    UCA0BR0 = 160;                              
                    UCA0BR1 = 1;                              
                    UCA0MCTL = UCBRS_6;                       
                    break;

                case (int)19200:
                    UCA0BR0 = 208;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_3;                       
                    break;

                case (int)38400:
                    UCA0BR0 = 104;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_1;                       
                    break;

                case (int)57600:
                    UCA0BR0 = 69;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_4;                       
                    break;

                case (int)115200:
                    UCA0BR0 = 34;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_6;                       
                    break;

                case (int)230400:
                    UCA0BR0 = 17;                              
                    UCA0BR1 = 0;                              
                    UCA0MCTL = UCBRS_3;                       
                    break;
                
                default:
                    perror("Error: Something went wrong in selecting baudrate.");
                    break; 
            }
        break;

        case (int)8000000:
                    switch ((int)baudrate) {
                        case (int)9600:
                            UCA0BR0 = 65;                              
                            UCA0BR1 = 3;                              
                            UCA0MCTL = UCBRS_2;                       
                            break;

                        case (int)19200:
                            UCA0BR0 = 163;                              
                            UCA0BR1 = 1;                             
                            UCA0MCTL = UCBRS_6;                       
                            break;

