alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/functions/USCI.c
                        case (int)38400:
                            UCA0BR0 = 208;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_3;                       
                            break;

                        case (int)57600:
                            UCA0BR0 = 138;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_7;                       
                            break;

                        case (int)115200:
                            UCA0BR0 = 69;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_4;                       
                            break;

                        case (int)230400:
                            UCA0BR0 = 34;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_6;                       
                            break;
                        
                        case (int)460800:
                            UCA0BR0 = 17;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_3;                       
                            break;

                        default:
                            perror("Error: Something went wrong in selecting baudrate.");
                            break; 
                    }
        break;
        case (int)12000000:
                    perror("Error: MSP430FG479 does not have this frequency.");

                    switch ((int)baudrate) {
                        case (int)9600:
                            UCA0BR0 = 226;                              
                            UCA0BR1 = 4;                              
                            UCA0MCTL = UCBRS_0;                       
                            break;

                        case (int)19200:
                            UCA0BR0 = 113;                              
                            UCA0BR1 = 2;                             
                            UCA0MCTL = UCBRS_0;                       
                            break;

                        case (int)38400:
                            UCA0BR0 = 56;                              
                            UCA0BR1 = 1;                              
                            UCA0MCTL = UCBRS_4;                       
                            break;

                        case (int)57600:
                            UCA0BR0 = 208;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_2;                       
                            break;

                        case (int)115200:
                            UCA0BR0 = 104;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_1;                       
                            break;

                        case (int)230400:
                            UCA0BR0 = 52;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_0;                       
                            break;
                        
                        case (int)460800:
                            UCA0BR0 = 26;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_0;                       
                            break;

                        default:
                            perror("Error: Something went wrong in selecting baudrate.");
                            break; 
                    }
        break;


        case (int)16000000:
                    perror("Error: MSP430FG479 does not have this frequency.");
                    switch ((int)baudrate) {
                        case (int)9600:
                            UCA0BR0 = 130;                              
                            UCA0BR1 = 6;                              
                            UCA0MCTL = UCBRS_6;                       
                            break;

                        case (int)19200:
                            UCA0BR0 = 65;                              
                            UCA0BR1 = 3;                             
                            UCA0MCTL = UCBRS_2;                       
                            break;

                        case (int)38400:
                            UCA0BR0 = 160;                              
                            UCA0BR1 = 1;                              
                            UCA0MCTL = UCBRS_6;                       
                            break;

                        case (int)57600:
                            UCA0BR0 = 21;                              
                            UCA0BR1 = 1;                              
                            UCA0MCTL = UCBRS_7;                       
                            break;

                        case (int)115200:
                            UCA0BR0 = 138;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_7;                       
                            break;

                        case (int)230400:
                            UCA0BR0 = 69;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_4;                       
                            break;
                        
                        case (int)460800:
                            UCA0BR0 = 34;                              
                            UCA0BR1 = 0;                              
                            UCA0MCTL = UCBRS_6;                       
                            break;

                        default:
                            perror("Error: Something went wrong in selecting baudrate.");
                            break; 
                    }
                break;

