alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/functions/USCI.c
    }

}


// IrDA encoding enable
void IrDA_enable(bool IrDA_enabled){
    UCA0IRTCTL &= ~(UCIREN);
    if (IrDA_enabled){
        UCA0IRTCTL |= UCIREN;
    }

}

void IrDA_pulse_config(char IrDA_clk_ref, int IrDA_Transmit_Pulse_Length){
/* UCIRTXPL5 --> IRDA Transmit Pulse Length 5 */
/* UCIRTXPL4 --> IRDA Transmit Pulse Length 4 */
/* UCIRTXPL3 --> IRDA Transmit Pulse Length 3 */
/* UCIRTXPL2 --> IRDA Transmit Pulse Length 2 */
/* UCIRTXPL1 --> IRDA Transmit Pulse Length 1 */
/* UCIRTXPL0 --> IRDA Transmit Pulse Length 0 */
    UCA0IRTCTL &= ~(UCIRTXCLK|UCIRTXPL5|UCIRTXPL4|UCIRTXPL3|UCIRTXPL2|UCIRTXPL1|UCIRTXPL0);    
    switch (IrDA_clk_ref) {
        case 'I': // BITCLK16 
            UCA0IRTCTL |= UCIRTXCLK;
            break;
        case 'R': // BRCLK 
            break;
        default:
            perror("Error: Not available IrDA clk reference.");
            break; 
    }
    switch (IrDA_Transmit_Pulse_Length) {
        case 5:
            UCA0IRTCTL |= UCIRTXPL5;        
            break;
        case 4:
            UCA0IRTCTL |= UCIRTXPL4;        
            break;
        case 3:
            UCA0IRTCTL |= UCIRTXPL3;        
            break;
        case 2:
            UCA0IRTCTL |= UCIRTXPL2;        
            break;
        case 1:
            UCA0IRTCTL |= UCIRTXPL1;        
            break;
        case 0:
            UCA0IRTCTL |= UCIRTXPL0;        
            break;
        default:
            perror("Error: Not available IrDA clk divider proportion.");
            break; 
    }    

}

void IrDA_detect_value(int H_L_detect){
    UCA0IRRCTL &= ~(UCIRRXPL);
    if (H_L_detect==0){
        UCA0IRRCTL |= UCIRRXPL;
    }
}


void IrDA_decoding_filter(bool IrDA_dec_filter_enabled, int IrDA_Receive_Filter_Length){
/*UCIRRXFL5 -->  IRDA Receive Filter Length 5 */
/*UCIRRXFL4 -->  IRDA Receive Filter Length 4 */
/*UCIRRXFL3 -->  IRDA Receive Filter Length 3 */
/*UCIRRXFL2 -->  IRDA Receive Filter Length 2 */
/*UCIRRXFL1 -->  IRDA Receive Filter Length 1 */
/*UCIRRXFL0 -->  IRDA Receive Filter Length 0 */
    UCA0IRRCTL &= ~(UCIRRXFE|UCIRRXFL5|UCIRRXFL4|UCIRRXFL3|UCIRRXFL2|UCIRRXFL1|UCIRRXFL0);
    if (IrDA_dec_filter_enabled){
        UCA0IRRCTL |= UCIRRXFE;
    }
    switch (IrDA_Receive_Filter_Length) {
        case 5:
            UCA0IRRCTL |= UCIRRXFL5;
            break;
        case 4:
            UCA0IRRCTL |= UCIRRXFL4;
            break;
        case 3:
            UCA0IRRCTL |= UCIRRXFL3;
            break;
        case 2:
            UCA0IRRCTL |= UCIRRXFL2;
            break;
        case 1:
            UCA0IRRCTL |= UCIRRXFL1;
            break;
        case 0:
            UCA0IRRCTL |= UCIRRXFL0;
            break;
        default:
            perror("Error: Not available IrDA decoder digital filter configuration.");
            break; 
    }
}

//*****************************************************************************
/*SPI RELATED FUNCTIONS*/
//*****************************************************************************

void USCI_SPI_pin_setup(){
    P2SEL |= BIT4+BIT5;                          // P2.4,2.5 option select
    P3SEL |= BIT0;                            // P3.0 option select
  }

void USCI_SPI_B_pin_setup(){
    P3SEL |= BIT1+BIT2;                          // P3.2,3.1 option select miso, mosi
    P3SEL |= BIT3;                            // P3.3 option select
}

void SPI_mode_config(char Master_Slave){
    /*
    Selection if the controller works as Master (M) or Slave (S)*/
    UCA0CTL0 &= ~(UCMST);
    switch (Master_Slave) {
        case 'M':
            UCA0CTL0 |= UCMST;
            break;

        case 'S':
            break;

        default:
            perror("Error: Not available SPI mode configuration.");
            break;

    }
}


void SPI_B_mode_config(char Master_Slave){
    /*
    Selection if the controller works as Master (M) or Slave (S)*/
    UCB0CTL0 &= ~(UCMST);
    switch (Master_Slave) {
        case 'M':
            UCB0CTL0 |= UCMST;
            break;

        case 'S':
            break;

        default:
            perror("Error: Not available SPI mode configuration.");
            break;

    }
}

void SPI_char_format(int SPI_length, char first_Byte_sent){
    UCA0CTL0 &= ~(UC7BIT|UCMSB);
    switch (SPI_length) {
        case 7:
            UCA0CTL0 |= UC7BIT;
            break;
        
        case 8:
            break;

        default:
            perror("Error: Not available SPI char length format configuration.");
            break;

    }


    switch (first_Byte_sent) {
        case 'M':
            UCA0CTL0 |= UCMSB;
            break;
        
        case 'L':
            break;

        default:
            perror("Error: Not available SPI char first byte sent format configuration.");
            break;

    }
}


void SPI_B_char_format(int SPI_length, char first_Byte_sent){
    UCB0CTL0 &= ~(UC7BIT|UCMSB);
    switch (SPI_length) {
        case 7:
            UCB0CTL0 |= UC7BIT;
            break;
        
        case 8:
            break;

        default:
            perror("Error: Not available SPI char length format configuration.");
            break;

    }


    switch (first_Byte_sent) {
        case 'M':
            UCB0CTL0 |= UCMSB;
            break;
        
        case 'L':
            break;

        default:
            perror("Error: Not available SPI char first byte sent format configuration.");
            break;

    }
}


void SPI_clk_division(int clk_div){
    //UCBRX = UCA0BR0 + UCA0BR1*256;
    int prod = round(clk_div/256);
    UCA0BR1 = prod;
    UCA0BR0 = clk_div-prod*256;

    //reset the modulation value because with USCIA0 is recommended 
    UCA0MCTL = 0;                             // No modulation
}

void SPI_B_clk_division(int clk_div){
    //UCBRX = UCA0BR0 + UCA0BR1*256;
    int prod = round(clk_div/256);
    UCB0BR1 = prod;
    UCB0BR0 = clk_div-prod*256;

    //reset the modulation value because with USCIB0 is recommended 
    // UCB0MCTL = 0;                             // No modulation
}

void SPI_clk_polarity_phase(char inactive_state, char data_on_clock_edge){
    UCA0CTL0  &= ~(UCCKPH|UCCKPL);    //3-pin, 8-bit SPI master

    switch (inactive_state) {
        case 'L': // clock polarity inactive low

            break;
        
        case 'H': // clock polarity inactive high
            UCA0CTL0 |= UCCKPL;
            break;
        
        default: 
            perror("Error: Not available SPI clock polarity.");
            break;
    }

    switch (data_on_clock_edge) {
        case 'H': //data cHanged on the first UCLK edge and captured on the following edge
            break;
        case 'A': //data cAptured on the first UCLK edge and changed on the following edge
            UCA0CTL0 |= UCCKPH;
            break;
        default:
            perror("Error: Not available SPI clock polarity.");
            break;

    }
}


void SPI_B_clk_polarity_phase(char inactive_state, char data_on_clock_edge){
    UCB0CTL0  &= ~(UCCKPH|UCCKPL);    //3-pin, 8-bit SPI master

    switch (inactive_state) {
        case 'L': // clock polarity inactive low

            break;
        
        case 'H': // clock polarity inactive high
            UCB0CTL0 |= UCCKPL;
            break;
        
        default: 
            perror("Error: Not available SPI clock polarity.");
            break;
    }

    switch (data_on_clock_edge) {
        case 'H': //data cHanged on the first UCLK edge and captured on the following edge
            break;
        case 'A': //data cAptured on the first UCLK edge and changed on the following edge
            UCB0CTL0 |= UCCKPH;
            break;
        default:
            perror("Error: Not available SPI clock polarity.");
            break;

    }
}


